# 의사소통과 언어 사용

1. 보편언어
유연하고 풍부한 지식이 담긴 설계를 만들려면 다용도로 사용할 수 있는 팀의 공유 언어와 그 언어에 대한 활발한
실험이 필요하다. 하지만 아쉽게도 소프트웨어 프로젝트에서는 그와 같은 실험이 거의 일어나지 않는다.

일부 사람들만 쓰는 언어는 모두의 필요서를 충족하지 못하므로 공통 언어가 될 수 없다.

모델을 언어의 근간으로 사용하라. 팀 내 모든 의사소통과 코드에서 해당 언어를 끊임없이 적용하는데 전념하라. 다이어그램과
문서에서, 그리고 특히 말할 때 동일한 언어를 사용하라.
보편언어의 변화가 곧 모델의 변화이다.

도메인 전문가는 도메인을 이해하는데 부자연스럽고 부정확한 용어나 구조에 대해 반대 의사를 표명해야 한다.
개발자는 설계를 어렵게 만드는 모호함과 불일치를 찾아내는데 촉각을 곤두 세워야 한다.


![image](https://user-images.githubusercontent.com/20812458/212480935-0b0cfcb7-c5c3-457e-94c2-707c2dfe973b.png)
![image](https://user-images.githubusercontent.com/20812458/212481275-470216cc-6a96-446f-ba3c-3abf8116e697.png)
